Revit 2024 API
FabricSheetType.GetReinforcementRoundingManager Method
 Returns an object for managing reinforcement rounding override settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public FabricRoundingManager GetReinforcementRoundingManager()
Visual Basic
Public Function GetReinforcementRoundingManager As FabricRoundingManager
Visual C++
public:
FabricRoundingManager^ GetReinforcementRoundingManager()
Return Value
 The rounding manager.
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace